---
kind: method
id: M:Autodesk.Revit.DB.Analysis.AnalysisDisplayMarkersAndTextSettings.IsEqual(Autodesk.Revit.DB.Analysis.AnalysisDisplayMarkersAndTextSettings)
source: html/aa9e61db-bcc0-1209-8e08-0653bb0db197.htm
---
# Autodesk.Revit.DB.Analysis.AnalysisDisplayMarkersAndTextSettings.IsEqual Method

Compares two colored surface settings objects.

## Syntax (C#)
```csharp
public bool IsEqual(
	AnalysisDisplayMarkersAndTextSettings other
)
```

## Parameters
- **other** (`Autodesk.Revit.DB.Analysis.AnalysisDisplayMarkersAndTextSettings`) - Markers and text settings object to compare with.

## Returns
True if objects are equal, false otherwise.